Tekla Open API Reference for Tekla Structures 2025
ScalingOptions Enumeration
 The options for controlling the scaling of the objects in the drawing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ScalingOptions
Public Enumeration ScalingOptions
Members
Member name | Value | Description
NoScaling | 0 | Does not scale the object.
ScaleToFit | 4 | Scales the object to fit in the frame in the Y direction.
See Also
Reference
Tekla.Structures.Drawing Namespace